Tekla.Structures.Drawing.AssemblyDrawing
The AssemblyDrawing class is for handling assembly drawings.

Tekla.Structures.Drawing.AssemblyDrawing.AssemblyIdentifier
The identifier of the model object assembly.

Tekla.Structures.Drawing.AssemblyDrawing.SheetNumber
The sheet number of the drawing.

Tekla.Structures.Drawing.AssemblyDrawing.#ctor(Tekla.Structures.Identifier)
Instantiates a new assembly drawing with standard attributes.
assemblyIdentifier: The identifier of the model object assembly

Tekla.Structures.Drawing.AssemblyDrawing.#ctor(Tekla.Structures.Identifier,System.String)
Instantiates a new assembly drawing with given attributes.
assemblyIdentifier: The identifier of the model object assembly
AttributeFile: The filename of the attributes file.

Tekla.Structures.Drawing.AssemblyDrawing.#ctor(Tekla.Structures.Identifier,System.Int32)
Instantiates a new assembly drawing with standard attributes and with a specified sheet number.
assemblyIdentifier: The identifier of the model object assembly
sheetNumber: The sheet number of the drawing.

Tekla.Structures.Drawing.AssemblyDrawing.#ctor(Tekla.Structures.Identifier,System.Int32,System.String)
Instantiates a new assembly drawing with given attributes and with a specified sheet number.
assemblyIdentifier: The identifier of the model object assembly
sheetNumber: The sheet number of the drawing.
AttributeFile: The filename of the attributes file.

Tekla.Structures.Drawing.AssemblyDrawing.Modify
Updates the drawing object in the database.
Returns: True on success.

Tekla.Structures.Drawing.AssemblyDrawing.Insert
Inserts a new assembly drawing. Views are added according to the View Creation rules of the standard file.
A drawing can be inserted only when there is no active drawing.
Returns: True on success.
Throws Tekla.Structures.Drawing.CannotInsertDrawingException: Thrown if inserting a drawing when another drawing is active.

Tekla.Structures.Drawing.AssemblyDrawing.Select
Selects the drawing.
Returns: True on success.